import '../index.css';

export default function UnderConstruction() {
    
    return (
        <>
            <div id="fix" className="fix">
                <h2>🔧 Ο ιστότοπος είναι προσωρινά υπό κατασκευή</h2>
                <p>Εργαζόμαστε εντατικά για να δημιουργήσουμε μια καλύτερη εμπειρία για εσάς.</p>
                <p>Στο μεταξύ, μπορείτε να περιηγηθείτε στις υπόλοιπες σελίδες μας.</p>
            </div>
            <footer className="footer">
                <p>&copy; 2025 Γεώργιος Παπαστεργίου. Με την επιφύλαξη παντός νομίμου δικαιώματος</p>
            </footer>
        </>
    );
}